package com.tcc.common.utils;

/**
 * 返回数据
 *
 */
public enum ResultCode{

	RESULT_401(401, "未登录或登录已过期"),
	RESULT_404(404, "未找到相关接口"),
	RESULT_500(500, "未知错误"),
	RESULT_601(601, "重复的记录"),
	RESULT_100001(100001, "账号或密码错误"),
	RESULT_100002(100002, "每人每天只能购买一单"),
	RESULT_100003(100003, "账户余额不足"),
	RESULT_100004(100004, "该订单未到销售时间"),
	RESULT_100005(100005, "未获取到符合条件的商品"),
	RESULT_100006(100006, "密码错误"),
	RESULT_100007(100007, "提现金额超过账户余额"),
	RESULT_100008(100008, "最小提现金额不能低于1000CFA"),
	RESULT_100009(100009, "当前IP注册人数超过可允许注册数量"),
	RESULT_100010(100010, "该账号已禁用"),
	RESULT_100011(100011, "该信用卡已绑定其他用户"),
	RESULT_100012(100012, "该产品已售完"),
	RESULT_100013(100013, "一个手机号只能注册一个账号"),
	RESULT_100014(100014, "请填写正确格式的数据"),
	RESULT_100015(100015, "您有未完结的订单"),
	RESULT_100016(100016, "请填写正确的邀请码"),
	RESULT_100017(100017, "每天只能提交一次提现申请"),
	RESULT_100018(100018, "您的等级不足"),
	RESULT_100019(100019, "每天只能签到一次"),
	RESULT_100020(100020, "不在活动时间范围"),
	RESULT_100021(100021, "今天已超过抽奖次数限制"),
	RESULT_100022(100022, "请不要重复操作"),
	RESULT_100023(100023, "该产品只能购买一次"),
	RESULT_100024(100024, "等级不够，无法做任务"),
	RESULT_100025(100025, "不满足升级条件，无法解锁"),
	RESULT_100026(100026, "今日任务已完成，明天再来做任务"),
	RESULT_100027(100027, "至少需升级到VIP1才能提现"),
	RESULT_100028(100028, "提现金额必须是最低提现金额的整数倍"),
	RESULT_100029(100029, "周六、周日不提现"),
	RESULT_100030(100030, "未找到产品,请重新再试"),
	RESULT_100031(100031, "抽奖次数已用完,分享得抽奖次数"),
	RESULT_100032(100032, "奖品已抽完"),
	RESULT_100033(100033, "您的积分不足"),
	RESULT_100034(100034, "您为VIP0,超过可提现次数"),
	RESULT_100035(100035, "请完成当前任务后再进行提款"),
	RESULT_100036(100036, "充值金额不能小于最低充值金额"),
	RESULT_100037(100037, "IP禁止访问"),
	RESULT_100038(100038, "交易ID格式错误"),
	RESULT_100039(100039, "订单已过期,请重新下单"),
	RESULT_100040(100040, "订单不合法,请重新下单"),
	RESULT_100041(100041, "系统关闭提现"),
	RESULT_100042(100042, "系统关闭提现"),

	RESULT_100043(100043, "账户体验金不足"),
	RESULT_100044(100044, "领取收益间隔时间不足"),
	RESULT_100045(100045, "设备即将到期,等待发放奖励"),
	RESULT_100046(100046, "暂时没有匹配到租用设备"),

	RESULT_100047(100047, "该产品已下架"),
	RESULT_100048(100048, "当前设备已全部租用完，请等待新的设备租用"),
	RESULT_100049(100049, "不要频繁发送验证码"),
	RESULT_100050(100050, "验证码错误"),
	RESULT_100051(100051, "手机号不正确"),
	RESULT_100052(100052, "消费金额不足"),
	RESULT_100053(100053, "宝箱码不能为空"),
	RESULT_100054(100054, "宝箱领取失败"),
	RESULT_100055(100055, "宝箱已过期"),
	RESULT_100056(100056, "不能重复领取"),
	RESULT_100057(100057, "宝箱已抢完"),
	RESULT_100058(100058, "非充值用户不能提款"),
	RESULT_100059(100059, "该级别产品无购买权限"),
	;

	private int code;

	private String msg;

	ResultCode(int code, String msg){
		this.code = code;
		this.msg = msg;
	}

	public int getCode() {
		return code;
	}

	public void setCode(int code) {
		this.code = code;
	}

	public String getMsg() {
		return msg;
	}

	public void setMsg(String msg) {
		this.msg = msg;
	}
}
